[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:61:46
               id="requesterEmail"
               type="text"
               isInvalid={Boolean(errors.requesterEmail)}
-              {...register("requesterEmail", {
-                required: true,
-                pattern: email_regex,
-              })}
+              {...register("requesterEmail", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.jsx:68:16
             />
             <Form.Control.Feedback type="invalid">
               {errors.requesterEmail && "Requester Email is required. "}
-              {errors.requesterEmail?.type === "pattern" &&
-                "Requester Email must be a valid email address, eg. example@example.com"}
+              {true}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/HelpRequest/HelpRequestForm.jsx:81:38
               id="teamId"
               type="text"
               isInvalid={Boolean(errors.teamId)}
-              {...register("teamId", {
-                required: true,
-              })}
+              {...register("teamId", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /teamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.jsx:86:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.teamId && "teamId is required. "}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /teamId is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.jsx:172:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.solved &&
-                "Whether the request is solved ('true' or 'false') is required. "}
+              {errors.solved || "Whether the request is solved ('true' or 'false') is required. "}
               {errors.solved?.type === "pattern" &&
                 "Whether the request is solved must be a boolean value ('true' or 'false')."}
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Requester Email must be a valid email address/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.jsx:172:16
               })}
             />
             <Form.Control.Feedback type="invalid">
-              {errors.solved &&
-                "Whether the request is solved ('true' or 'false') is required. "}
+              {false}
               {errors.solved?.type === "pattern" &&
                 "Whether the request is solved must be a boolean value ('true' or 'false')."}
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Whether the request is solved \('true' or 'false'\) is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:173:17
             />
             <Form.Control.Feedback type="invalid">
               {errors.solved &&
-                "Whether the request is solved ('true' or 'false') is required. "}
+                ""}
               {errors.solved?.type === "pattern" &&
                 "Whether the request is solved must be a boolean value ('true' or 'false')."}
killedBy: HelpRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Whether the request is solved \('true' or 'false'\) is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/HelpRequest/HelpRequestForm.jsx:174:16
             <Form.Control.Feedback type="invalid">
               {errors.solved &&
                 "Whether the request is solved ('true' or 'false') is required. "}
-              {errors.solved?.type === "pattern" &&
-                "Whether the request is solved must be a boolean value ('true' or 'false')."}
+              {errors.solved?.type === "pattern" || "Whether the request is solved must be a boolean value ('true' or 'false')."}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Whether the request is solved must be a boolean value/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/HelpRequest/HelpRequestForm.jsx:174:16
             <Form.Control.Feedback type="invalid">
               {errors.solved &&
                 "Whether the request is solved ('true' or 'false') is required. "}
-              {errors.solved?.type === "pattern" &&
-                "Whether the request is solved must be a boolean value ('true' or 'false')."}
+              {false}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Whether the request is solved must be a boolean value/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestForm.jsx:175:17
               {errors.solved &&
                 "Whether the request is solved ('true' or 'false') is required. "}
               {errors.solved?.type === "pattern" &&
-                "Whether the request is solved must be a boolean value ('true' or 'false')."}
+                ""}
             </Form.Control.Feedback>
           </Form.Group>
killedBy: HelpRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Whether the request is solved must be a boolean value/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
