[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:55:28
               type="text"
               isInvalid={Boolean(errors.title)}
               placeholder="e.g. My Article Title"
-              {...register("title", {
+              {...register("", {
                 required: "Title is required.",
               })}
killedBy: ArticlesForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:114:28
               type="text"
               isInvalid={Boolean(errors.email)}
               placeholder="e.g. user@example.com"
-              {...register("email", {
+              {...register("", {
                 required: "Email is required.",
                 pattern: {
killedBy: ArticlesForm tests renders correctly
statusReason: Cannot read properties of undefined (reading '_f')

[Killed] ObjectLiteral
main/components/Articles/ArticlesForm.jsx:141:41
               type="text"
               isInvalid={Boolean(errors.dateAdded)}
               placeholder="e.g. 2022-01-02T12:00:00"
-              {...register("dateAdded", {
-                required: "Date Added is required.",
-                pattern: {
-                  value: isodate_regex,
-                  message:
-                    "Date Added must be in ISO format (e.g. 2022-01-02T12:00:00).",
-                },
-              })}
+              {...register("dateAdded", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Date Added must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:142:27
               isInvalid={Boolean(errors.dateAdded)}
               placeholder="e.g. 2022-01-02T12:00:00"
               {...register("dateAdded", {
-                required: "Date Added is required.",
+                required: "",
                 pattern: {
                   value: isodate_regex,
killedBy: ArticlesForm tests Correct Error messages on missing input
statusReason: Unable to find an element with the text: /Date Added is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/Articles/ArticlesForm.jsx:146:21
                 pattern: {
                   value: isodate_regex,
                   message:
-                    "Date Added must be in ISO format (e.g. 2022-01-02T12:00:00).",
+                    "",
                 },
               })}
killedBy: ArticlesForm tests Correct Error messages on bad input
statusReason: Unable to find an element with the text: /Date Added must be in ISO format/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
