[Killed] ArrowFunction
main/components/Articles/ArticlesTable.jsx:15:35
     navigate(`/articles/edit/${cell.row.original.id}`);
   };
 
-  const cellToAxiosParamsDelete = (cell) => ({
-    url: "/api/articles",
-    method: "DELETE",
-    params: { id: cell.row.original.id },
-  });
+  const cellToAxiosParamsDelete = () => undefined;
 
   const onDeleteSuccess = (message) => {
killedBy: ArticlesTable tests Delete button calls delete callback
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <table

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:40:5
   };
 
   const columns = [
-    { header: "id", accessorKey: "id" },
+    {},
     { header: "Title", accessorKey: "title" },
     { header: "URL", accessorKey: "url" },
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:41:37
 
   const columns = [
     { header: "id", accessorKey: "id" },
-    { header: "Title", accessorKey: "title" },
+    { header: "Title", accessorKey: "" },
     { header: "URL", accessorKey: "url" },
     { header: "Explanation", accessorKey: "explanation" },
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-title"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:41:5
 
   const columns = [
     { header: "id", accessorKey: "id" },
-    { header: "Title", accessorKey: "title" },
+    {},
     { header: "URL", accessorKey: "url" },
     { header: "Explanation", accessorKey: "explanation" },
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] ObjectLiteral
main/components/Articles/ArticlesTable.jsx:42:5
   const columns = [
     { header: "id", accessorKey: "id" },
     { header: "Title", accessorKey: "title" },
-    { header: "URL", accessorKey: "url" },
+    {},
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Email", accessorKey: "email" },
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:42:35
   const columns = [
     { header: "id", accessorKey: "id" },
     { header: "Title", accessorKey: "title" },
-    { header: "URL", accessorKey: "url" },
+    { header: "URL", accessorKey: "" },
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Email", accessorKey: "email" },
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-url"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:43:15
     { header: "id", accessorKey: "id" },
     { header: "Title", accessorKey: "title" },
     { header: "URL", accessorKey: "url" },
-    { header: "Explanation", accessorKey: "explanation" },
+    { header: "", accessorKey: "explanation" },
     { header: "Email", accessorKey: "email" },
     { header: "Date Added", accessorKey: "dateAdded" },
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Explanation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:45:15
     { header: "URL", accessorKey: "url" },
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Email", accessorKey: "email" },
-    { header: "Date Added", accessorKey: "dateAdded" },
+    { header: "", accessorKey: "dateAdded" },
   ];
 
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element with the text: Date Added. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:45:42
     { header: "URL", accessorKey: "url" },
     { header: "Explanation", accessorKey: "explanation" },
     { header: "Email", accessorKey: "email" },
-    { header: "Date Added", accessorKey: "dateAdded" },
+    { header: "Date Added", accessorKey: "" },
   ];
 
killedBy: ArticlesTable tests Has the expected column headers and content for ordinary user
statusReason: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-dateAdded"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"
