[Killed] BlockStatement
main/pages/Articles/ArticlesCreatePage.jsx:20:34
     },
   });
 
-  const onSuccess = (article) => {
-    toast(`New Article Created - id: ${article.id} title: ${article.title}`);
-  };
+  const onSuccess = (article) => {};
 
   const mutation = useBackendMutation(
killedBy: ArticlesCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
