[Killed] StringLiteral
main/components/MenuItemReviews/MenuItemReviewsTable.jsx:65:30
       ButtonColumn("Edit", "primary", editCallback, "MenuItemReviewsTable"),
     );
     columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "MenuItemReviewsTable"),
+      ButtonColumn("Delete", "", deleteCallback, "MenuItemReviewsTable"),
     );
   }
killedBy: UserTable tests Has the expected colum headers and content for adminUser
statusReason: expect(element).toHaveClass("btn-danger")

Expected the element to have class:
  btn-danger
Received:
  btn
